Terraform v0.12.19
Configuring remote state backend...
Initializing Terraform configuration...
2020/01/17 05:45:11 [DEBUG] Using modified User-Agent: Terraform/0.12.19 TFC/6d7e311ccd
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.


------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # tencentcloud_instance.saicgm[0] will be created
  + resource "tencentcloud_instance" "saicgm" {
      + allocate_public_ip         = false
      + availability_zone          = "ap-guangzhou-3"
      + create_time                = (known after apply)
      + disable_monitor_service    = false
      + disable_security_service   = false
      + expired_time               = (known after apply)
      + id                         = (known after apply)
      + image_id                   = "img-pi0ii46r"
      + instance_charge_type       = "POSTPAID_BY_HOUR"
      + instance_name              = "trading-service"
      + instance_status            = (known after apply)
      + instance_type              = "S2.SMALL1"
      + internet_charge_type       = "TRAFFIC_POSTPAID_BY_HOUR"
      + internet_max_bandwidth_out = 10
      + key_name                   = (known after apply)
      + private_ip                 = (known after apply)
      + project_id                 = 0
      + public_ip                  = (known after apply)
      + running_flag               = true
      + security_groups            = (known after apply)
      + subnet_id                  = (known after apply)
      + system_disk_id             = (known after apply)
      + system_disk_size           = 50
      + system_disk_type           = "CLOUD_PREMIUM"
      + vpc_id                     = (known after apply)

      + data_disks {
          + data_disk_id         = (known after apply)
          + data_disk_size       = (known after apply)
          + data_disk_type       = (known after apply)
          + delete_with_instance = (known after apply)
        }
    }

  # tencentcloud_instance.webservers[0] will be created
  + resource "tencentcloud_instance" "webservers" {
      + allocate_public_ip         = true
      + availability_zone          = "ap-guangzhou-3"
      + create_time                = (known after apply)
      + disable_monitor_service    = false
      + disable_security_service   = false
      + expired_time               = (known after apply)
      + id                         = (known after apply)
      + image_id                   = "img-pi0ii46r"
      + instance_charge_type       = "POSTPAID_BY_HOUR"
      + instance_name              = "nginx-service0"
      + instance_status            = (known after apply)
      + instance_type              = "S2.SMALL1"
      + internet_charge_type       = "TRAFFIC_POSTPAID_BY_HOUR"
      + internet_max_bandwidth_out = 10
      + key_name                   = (known after apply)
      + private_ip                 = (known after apply)
      + project_id                 = 0
      + public_ip                  = (known after apply)
      + running_flag               = true
      + security_groups            = (known after apply)
      + subnet_id                  = (known after apply)
      + system_disk_id             = (known after apply)
      + system_disk_size           = 50
      + system_disk_type           = "CLOUD_PREMIUM"
      + vpc_id                     = (known after apply)

      + data_disks {
          + data_disk_id         = (known after apply)
          + data_disk_size       = (known after apply)
          + data_disk_type       = (known after apply)
          + delete_with_instance = (known after apply)
        }
    }

  # tencentcloud_route_table.db will be created
  + resource "tencentcloud_route_table" "db" {
      + create_time     = (known after apply)
      + id              = (known after apply)
      + is_default      = (known after apply)
      + name            = "my test db route table"
      + route_entry_ids = (known after apply)
      + subnet_ids      = (known after apply)
      + vpc_id          = (known after apply)
    }

  # tencentcloud_route_table.web will be created
  + resource "tencentcloud_route_table" "web" {
      + create_time     = (known after apply)
      + id              = (known after apply)
      + is_default      = (known after apply)
      + name            = "my test web route table"
      + route_entry_ids = (known after apply)
      + subnet_ids      = (known after apply)
      + vpc_id          = (known after apply)
    }

  # tencentcloud_security_group.db will be created
  + resource "tencentcloud_security_group" "db" {
      + description = "make it accessible for both mysql and SSH from web tier"
      + id          = (known after apply)
      + name        = "web accessibility"
      + project_id  = (known after apply)
    }

  # tencentcloud_security_group.web will be created
  + resource "tencentcloud_security_group" "web" {
      + description = "make it accessible for both HTTP and SSH"
      + id          = (known after apply)
      + name        = "web accessibility"
      + project_id  = (known after apply)
    }

  # tencentcloud_security_group_rule.mysql-from-webtier will be created
  + resource "tencentcloud_security_group_rule" "mysql-from-webtier" {
      + cidr_ip           = "10.0.1.0/24"
      + description       = (known after apply)
      + id                = (known after apply)
      + ip_protocol       = "tcp"
      + policy            = "accept"
      + port_range        = "22,3306"
      + security_group_id = (known after apply)
      + source_sgid       = (known after apply)
      + type              = "ingress"
    }

  # tencentcloud_security_group_rule.web-from-public will be created
  + resource "tencentcloud_security_group_rule" "web-from-public" {
      + cidr_ip           = "0.0.0.0/0"
      + description       = (known after apply)
      + id                = (known after apply)
      + ip_protocol       = "tcp"
      + policy            = "accept"
      + port_range        = "80,22"
      + security_group_id = (known after apply)
      + source_sgid       = (known after apply)
      + type              = "ingress"
    }

  # tencentcloud_subnet.db will be created
  + resource "tencentcloud_subnet" "db" {
      + availability_zone  = "ap-guangzhou-3"
      + available_ip_count = (known after apply)
      + cidr_block         = "10.0.2.0/24"
      + create_time        = (known after apply)
      + id                 = (known after apply)
      + is_default         = (known after apply)
      + is_multicast       = true
      + name               = "my test subnet"
      + route_table_id     = (known after apply)
      + vpc_id             = (known after apply)
    }

  # tencentcloud_subnet.web will be created
  + resource "tencentcloud_subnet" "web" {
      + availability_zone  = "ap-guangzhou-3"
      + available_ip_count = (known after apply)
      + cidr_block         = "10.0.1.0/24"
      + create_time        = (known after apply)
      + id                 = (known after apply)
      + is_default         = (known after apply)
      + is_multicast       = true
      + name               = "my test subnet"
      + route_table_id     = (known after apply)
      + vpc_id             = (known after apply)
    }

  # tencentcloud_vpc.main will be created
  + resource "tencentcloud_vpc" "main" {
      + cidr_block   = "10.0.0.0/16"
      + create_time  = (known after apply)
      + dns_servers  = (known after apply)
      + id           = (known after apply)
      + is_default   = (known after apply)
      + is_multicast = true
      + name         = "my test vpc"
    }

Plan: 11 to add, 0 to change, 0 to destroy.

Warning: Interpolation-only expressions are deprecated

  on cvm.tf line 12, in resource "tencentcloud_instance" "webservers":
  12: vpc_id    = "${tencentcloud_vpc.main.id}"

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.

(and 11 more similar warnings elsewhere)